src/docs/worldline/tests/Zed/WorldlineWebhook/_data/payment_created_event.json

{
    "apiVersion": "v1",
    "id": "97a4fcdf-9a08-4a59-a0c0-69bfd7e1d59d",
    "created": "2017-09-14T17:14:39.688+0200",
    "merchantId": "20000",
    "type": "payment.created",
    "payment": {
        "id": "12345",
        "paymentOutput": {
            "amountOfMoney": {
                "amount": 1000,
                "currencyCode": "EUR"
            },
            "references": {
                "paymentReference": "200001681810"
            },
            "paymentMethod": "bankTransfer",
            "bankTransferPaymentMethodSpecificOutput": {
                "paymentProductId": 11
            }
        },
        "status": "CREATED",
        "statusOutput": {
            "isCancellable": false,
            "statusCategory": "CREATED",
            "statusCode": 0,
            "statusCodeChangeDateTime": "20170901170000",
            "isAuthorized": false
        }
    }
}
